{
  "ru": [
    {
      "header": "Детство и школьные годы",
      "text": [
        "Я, Жигарев Михаил Юрьевич, родился 11 февраля 1994 года в городе Доброполье, Донецкой области. Я с 3 лет начал ходить в садик, в том же возрасте научился читать. А с 5 лет пошел в секцию «Спортивная гимнастика».",
        "1 сентября 2001 года я пошел в общеобразовательную школу №19 г. Доброполья, которую окончил в 2012 году. За время обучения в школе, увлекался разными видами спорта, такими как: гимнастика, футбол, скалолазание. Занимаясь скалолазанием, я часто ходил в походы по различным живописным местам Украины: в Крым, Карпаты, на остров Хортица. Путешествуя по Крыму, мы с товарищами посещали различные экскурсии, лазали по скалам. В Карпатах я принимал участие в восхождении на высочайшую горную вершину Украины — Говерлу."
      ]
    },
    {
      "header": "Университет",
      "text": [
        "В 2012 году поступил в Донецкий национальный технический университет на специальность: «Системы технической защиты информации с ограниченным доступом, автоматизация ее обработки». После поступления в университет, я продолжил заниматься скалолазанием, посещая манеж Донецкого национального технического университета и участвуя в соревнованиях. Наиболее запомнилось участие в чемпионате области по скалолазанию в г.Донецке, где я занял 1 место в дисциплинах «Скорость» и «Трудность», а также финал кубка Украины в г.Харькове, где я занял 6 место в дисциплине «Скорость».",
        "Летом 2016 года я защитил дипломный проект на тему «Исследование принципов управления и позиционирования системой с трех векторной степенью свободы передвижения». После получения диплома бакалавра я поступил на магистратуру Донецкого национально технического университета по специальности: «Информационная безопасность»."
      ]
    },
    {
      "header": "Цели, планы и видение будущего",
      "text": [
        "На данном этапе моими основными целями являются успешное завершение обучения в университете, защита магистерской диссертации, а также поиск работы по специальности, с возможностью карьерного и профессионального роста. Уверен, что образование в Донецком национальном техническом университете и мой личный опыт помогут мне исполнить мои мечты и желания."
      ]
    }
  ],
  "ua": [
    {
      "header": "Дитинство і шкільні роки",
      "text": [
        "Я, Жигарев Михайло Юрійович, народився 11 лютого 1994 року в місті Добропілля, Донецької області. Я з 3 років почав ходити в садок, в тому ж віці навчився читати. А з 5 років пішов в секцію «Спортивна гімнастика».",
        "1 вересня 2001 року я пішов в загальноосвітню школу №19 м.Добропілля, яку закінчив в 2012 році. За час навчання в школі, захоплювався різними видами спорту, такими як: гімнастика, футбол, скелелазіння. Займаючись скелелазінням, я часто ходив у походи по різних мальовничих місцях України: в Крим, Карпати, на острів Хортиця. Подорожуючи по Криму, ми з товаришами відвідували різні екскурсії, лазили по скелях. У Карпатах я приймав участь в сходженні на найвищу гірську вершину України — Говерлу."
      ]
    },
    {
      "header": "Університет",
      "text": [
        "У 2012 році вступив до Донецького національного технічного університету на спеціальність: «Системи технічного захисту інформації з обмеженим доступом, автоматизація її обробки». Після вступу до університету, я продовжив займатися скелелазінням, відвідуючи манеж Донецького національного технічного університету та беручи участь в змаганнях. Найбільш запам'яталося участь в чемпіонаті області зі скелелазіння в м.Донецьку, де я зайняв 1 місце в дисциплінах «Швидкість» та «Труднощі», а також фінал кубка України в м.Харкові, де я зайняв 6 місце в дисципліні «Швидкість».",
        "Влітку 2016 року я захистив дипломний проект на тему «Дослідження принципів управління і позиціонування системою з трьох векторним ступенем свободи пересування». Після отримання диплома бакалавра я вступив на магістратуру Донецького національного технічного університету за спеціальністю: «Інформаційна безпека»."
      ]
    },
    {
      "header": "Цели, планы и видение будущего",
      "text": [
        "На даному етапі моїми основними цілями є успішне завершення навчання в університеті, захист магістерської дисертації, а також пошук роботи за фахом, з можливістю кар'єрного і професійного зростання. Упевнений, що освіта в Донецькому національному технічному університеті та мій особистий досвід допоможуть мені виконати мої мрії і бажання."
      ]
    }
  ]
}
