[
  {
    "title": "Собственные публикации и доклады",
    "fill": [
      {
        "title": "Управление бесколлекторными системами на базе AVR систем",
        "author": "М.Ю. Жигарев",
        "description": "В работе представлена система управления для бесколлекторного трехфазного двигателя, реализованная на базе микроконтроллера и силовых ключей, коммутирующих обмотки; предложен физический вариант реализации системы управления для бесколлекторного двигателя с внешним вращающимся ротором.",
        "source": "Инновационные перспективы Донбасса – Донецк, ДонНТУ – 2016.",
        "link": 0,
        "number": 1
      },
      {
        "title": "Аналитический расчет системы стабилизации квадрокоптера",
        "author": "М.Ю. Жигарев, В.В. Паслен",
        "description": "В работе представлен аналитический расчет системы стабилизации квадрокоптера, осуществляемый путем изменения длительности импульсов управляющих ШИМ-сигналов, генерируемых МК AtMega64.",
        "source": "Инновационные перспективы Донбасса – Донецк, ДонНТУ – 2017.",
        "link": 1,
        "number": 2
      },
      {
        "title": "Экспоненциальная фильтрация данных акселерометра",
        "author": "М.Ю. Жигарев, В.В. Паслен",
        "description": "В работе представлена реализация алгоритма экспоненциальной фильтрации данных акселерометра, используемого для исключения влияния внешних факторов; рассмотрена работа алгоритма в различных режимах.",
        "source": "Конференция “Донбасс будущего глазами молодых ученых” – Донецк, ДонНТУ – 2017.",
        "link": 2,
        "number": 3
      }
    ]
  },
  {
    "title": "Тематические статьи",
    "fill": [
      {
        "title": "Система управления мультикоптером",
        "author": "В.А Корнилов, Д.С. Молодяков, Ю.А. Синявская",
        "description": "В статье рассматривается задача синтеза системы управления беспилотным летательным аппаратом вертолетного типа. Предлагается вариант архитектуры системы автоматического управления (САУ), рассматриваются основные режимы полета и варианты управления.",
        "source": "Электронный журнал «Труды МАИ». Выпуск № 62 — 2012",
        "link": "https://www.mai.ru/upload/iblock/2f3/sistema-upravleniya-multikopterom.pdf",
        "shortlink": "https://www.mai.ru",
        "number": 4
      },
      {
        "title": "Нейросетевая реализация автоматического управления безопасной посадкой беспилотного летательного аппарата",
        "author": "А.В. Кузин, Д.В. Курмаков, А.В. Лукьянов, Д.А. Михайлин",
        "description": "Исследуются подходы к реализации нейросетевого регулятора в системе автоматического управления беспилотного летательного аппарата. Рассматривается полет БЛА в режиме захода на посадку и посадки при наличии ветрового возмущения в вертикальной плоскости. Представлены структура нейронной сети (НС) и моделирование результата обучения нейросетевого регулятора.",
        "source": "Электронный журнал «Труды МАИ». Выпуск № 70 — 2015",
        "link": "http://trudymai.ru/upload/iblock/771/771361e01ba512ffb321f28cc51fb712.pdf",
        "shortlink": "http://trudymai.ru",
        "number": 5
      },
      {
        "title": "Использование измерительной системы MPU 6050 для определения угловых скоростей и линейных ускорений",
        "author": "Д.С.Федоров, А.Ю. Ивойлов, В.А. Жмудь, В.Г. Трубин",
        "description": "В данной работе рассматривается использование модуля MPU6050 для определения угловых скоростей и линейных ускорений; рассмотрен принцип работы гироскопа; рассмотрен принцип работы модуля MPU6050; представлена реализация алгоритма определения угловых скоростей и линейных ускорений.",
        "source": "Научно-технический журнал “Автоматика и программная инженерия” — 2015, Том 1, — с. 75-80.",
        "link": "http://jurnal.nips.ru/sites/default/files/%D0%90%D0%98%D0%9F%D0%98-1-2015-11.pdf",
        "shortlink": "http://jurnal.nips.ru",
        "number": 6
      },
      {
        "title": "Имитационная модель бесконтактного электродвигателя Зыонг Дык Ха",
        "author": "Московский авиационный институт (национальный исследовательский университет)",
        "description": "В данной работе рассматривается разработка модели бесконтактных электродвигателей для системы моделирования и проектирования электронных устройств OrCAD-Pspice. Модели предназначаются для автоматизации проектирования, моделирования и оптимизации высокоточных электроприводов с учетом как свойств электронных узлов управления приводами, так и свойств передаточных механизмов и исполнительных устройств.",
        "source": "Электронный журнал «Труды МАИ». Выпуск № 73 — 2015",
        "link": "https://mai.ru/upload/iblock/cb7/cb76aeec02611a70b8b9a7e8fe381ff0.pdf",
        "shortlink": "https://mai.ru",
        "number": 7
      },
      {
        "title": "Использование акселерометра ADXL335 для определения угла отклонения от вертикали",
        "author": "Д.С.Федоров, А.Ю. Ивойлов, В.А. Жмудь, В.Г. Трубин",
        "description": "Рассматривается основные вопросы, возникающие при работе с акселерометром ADXL335: оцифровка сигналов c датчика и алгоритм вычисления угла с помощью отладочной платы STM32VLDISCOVERY.",
        "source": "Научно-технический журнал “Автоматика и программная инженерия” — 2014, Том 2, — с. 68-72.",
        "link": "http://jurnal.nips.ru/sites/default/files/АИПИ-2-2014-8_0.pdf",
        "shortlink": "http://jurnal.nips.ru",
        "number": 8
      },
      {
        "title": "Использование дифференцирующего фильтра второго порядка для фильтрации сигналов акселерометра и определения производной",
        "author": "Д.С.Федоров, А.Ю. Ивойлов, В.А. Жмудь, В.Г. Трубин",
        "description": "Рассматривается вопрос фильтрации и определения первой производной сигналов с акселерометра ADXL335.",
        "source": "Научно-технический журнал “Автоматика и программная инженерия” — 2014, Том 4, — с. 9-14.",
        "link": "http://jurnal.nips.ru/sites/default/files/АИПИ-4-2014-1_0.pdf",
        "shortlink": "http://jurnal.nips.ru",
        "number": 9
      },
      {
        "title": "Особенности моделирования MEMS-гироскопа",
        "author": "Саленко Д.С.",
        "description": "В данной статье рассмотрены MEMS-датчики для измерения угловой скорости – гироскопы. Также дано пояснение характеристикам гироскопа, важным при его моделировании как звена системы автоматического управления. Эти характеристики учтены при моделировании гироскопа в программе VisSim. Из этих результатов можно выявить влияние той или иной характеристики на результат моделирования объекта совместно с другими элементами системы (источниками сигналов и так далее).",
        "source": "Научно-технический журнал “Автоматика и программная инженерия” — 2015, Том 2, — с. 109-115.",
        "link": "http://jurnal.nips.ru/sites/default/files/АИПИ-2-2015-10.pdf",
        "shortlink": "http://jurnal.nips.ru",
        "number": 10
      }
    ]
  }
]
